---
kind: method
id: M:Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetMinSymbolHeight(Autodesk.Revit.DB.FamilySymbol)
source: html/c8c99699-11a6-2f18-b0dd-befc8ab7cf7a.htm
---
# Autodesk.Revit.DB.IFC.ExporterIFCUtils.GetMinSymbolHeight Method

Obtains the minimum height of the given FamilySymbol.

## Syntax (C#)
```csharp
public static double GetMinSymbolHeight(
	FamilySymbol symbol
)
```

## Parameters
- **symbol** (`Autodesk.Revit.DB.FamilySymbol`) - The family symbol.

## Returns
The minimum height.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null